SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-60503

Comment( ******REPORT BASED ADVANCED FEATURES APPLIED******* )

Comment( ************** General Information***************** )
Type ( Engine )
WagonShape ( DR_BR_A2-2_60503.s )
Size ( 2.82838m 4.08795m 13.611794m )
Mass ( 101.5t-uk )

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Stiffness ( 1e7N/m 1e7N/m )
			Damping ( 0.2e7N/m 0.2e7N/m )
			Break ( 710kN 1220kN )
			r0 ( 30cm 0cm )
		)
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Stiffness ( 1e6N/m 2e6N/m )
			Damping ( 1e6N/m 1e6N/m )
			Break ( 600kN 1000kN )
			r0 ( 20cm 0cm )
			)
	)
	
Comment( ********** Brakes, Type, Force, etc *************** )
BrakeEquipmentType( "Vacuum_brake, Auxilary_reservoir" )
BrakeSystemType( Vacuum_single_pipe )
MaxBrakeForce( 230kN ) Comment ( * braked approx 70% of mass on driving wheels, or 55% of Weight in Working Order, coefficient of friction 0.5 * )
MaxReleaseRate ( 2.5inHg/s ) 
MaxApplicationRate ( 2.0inHg/s )
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg ) 

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121) 

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.84m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 13.0ft 0.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

Comment( CN 1990 DWx18)
ORTSDavis_A ( 7158 )
ORTSDavis_B ( 33.93 )
ORTSDavis_C ( 5.449 )

ORTSWagonFrontalArea (102)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


Lights	( 2
		Light	(
			comment( Position B White )
			Type ( 0 )
			Conditions (
			Headlight ( 4 ) Unit( 2 )
			)
			Cycle ( 0 )
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			States ( 1
			State	(
			Duration ( 0.05 )
			LightColour ( ffffffff )
			Position ( 1.0 1.53 6.46 )
			Azimuth ( 0.0 -5.0 5.0 )
			Transition ( 0 )
			Radius ( 0.55 )
					)
				)
			)
		Light	(
			comment( Position D White )
			Type ( 0 )
			Conditions (
			Headlight ( 4 ) Unit ( 2 )
			)
			Cycle ( 0 )
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			States ( 1
			State	(
			Duration ( 0.05 )
			LightColour ( ffffffff )
			Position ( -1.0 1.53 6.46 )
			Azimuth ( 0.0 -5.0 5.0 )
			Transition ( 0 )
			Radius ( 0.55 )
					)
				)
			)
		)

Comment( ******* Miscellaneous Wagon Information************ )

Comment (Passenger View)	
	Inside (
        PassengerCabinFile ( DR_BR_A2-2_60503.s )
        PassengerCabinHeadPos ( 1.423 3.0 -5.25 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
Sound ("..\\..\\Common.Steam\\A1Sound\\A1eng.sms" )
)

Engine ( OR-60503

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)

			WhistleFX
			(
				0.3 4.1 -4.4
				0 1 0
				0.2
			)

			SafetyValvesFX
			(
				0 4.3 -4.6
				0 1 0
				0.2
			)
			SafetyValvesFX
			(
				0 4.3 -4.9
				0 1 0
				0.3
			)
			StackFX
			(
				0 4.2 4.309
				0 1 0
				0.3
			)
			StackFX
			(
				0 4.2 4.309
				0 1 0
				0.25
			)
			StackFX
			(
				0 4.2 4.309
				0 1 0
				0.25
			)
			Injectors2FX
			(
				-1.1 0.9 -6.2
				0 -1 0
				0.16
			)
			Injectors1FX
			(
				1.1 0.9 -6.2
				0 -1 0
				0.16
			)

			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-0.4 -1 -0.2
				0.05
			)

			CylindersFX
			(
				-1.046 0.547 3.991
				0 0 1
				0.16
			)

			CylindersFX
			(
				1.046 0.547 3.991
				0 0 1
				0.16
			)
		)
	)

Wagon ( OR-60503 )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 37in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 66t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 324ft^3 )  
ORTSEvaporationArea ( 2453.07ft^2 )
ORTSSuperheatArea ( 679.67ft^2 )
MaxBoilerPressure ( 225psi )
MaxSteamHeatingPressure ( 80psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 3 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 20in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 50ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ********************* Fuel ************************* )

MaxTenderCoalMass ( 9t-uk )
MaxTenderWaterMass ( 50000lb )
IsTenderRequired( 1 )	

Comment(       ********ADVANCED PARAMETERS**********      )

Comment(ORTSMaxIndicatedHorsepower 2066hp calculated by OR )

ORTSCylinderInitialPressureDrop ( 0.0 0.98 350 0.88 )
Comment (Reduced Performance)

ORTSBoilerEfficiency( 0.0 0.97  102.0 0.61 )Comment(Report Gr 16)comment(0 0.97 140.0 0.485)


ORTSBurnRate( 0.0 10.0   12000.0 1000.0   21000.0 2000.0   27000.0 3000.0   36000.0 4000.0   37000.0 5000.0   37500.0 6000.0  )

    
Comment ( ****************Brake System ******************** )   

BrakesTrainBrakeType( Vacuum_single_pipe )

Comment ( *** Ejectors *** )
Comment (  Estimate for Gresham & Craven SJ type P ejector  )
VacuumBrakesHasVacuumPump ( 0 )
ORTSBrakePipeChargingRate ( 0.34inHg/s )
VacuumBrakesLargeEjectorUsageRate ( 600lb/h )
VacuumBrakesSmallEjectorUsageRate ( 210lb/h )
VacuumBrakesMinBoilerPressureMaxVacuum ( 110psi )

Comment ( *** Train Brake Valve *** )
TrainBrakesControllerMaxSystemPressure ( 21inHg )
ORTSBrakePipeTimeFactor ( 0.02s )
ORTSBrakeServiceTimeFactor ( 10.0s )

     
Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Comment ( Based upon Gresham & Craven SJ Ejector and control valve )
Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )


ORTSSmallEjector ( 0 1 0.1 1.0 NumNotches ( 0 ) )

            FireDoor ( 0 1 0.075 1 
                NumNotches( 0 ))
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2 
                NumNotches( 0 ))
		 ORTSSteamHeat( 0 1 0.0125 0.5 )
            Shovel ( 0 1 1 0 
                NumNotches( 6 
				Notch ( 0     	0 Dummy )
				Notch ( 0.25	0 Dummy )
                   	Notch ( 0.5   	0 Dummy )
                   	Notch ( 0.75   	0 Dummy )
                   	Notch ( 1   	0 Dummy )
                   	Notch ( 2   	0 Dummy )
				)
            )
            DampersFront ( 0 1 0.1 0.15 
                NumNotches ( 6 
                		Notch ( 0     	0 Dummy )
                   	Notch ( 0.15   	0 Dummy )
                   	Notch ( 0.25   	0 Dummy )
                   	Notch ( 0.5   	0 Dummy )
                   	Notch ( 0.75   	0 Dummy )
				Notch ( 1		0 Dummy )
			)
		)
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0 
                NumNotches( 5 
				Notch ( 0     	0 Dummy )
                   	Notch ( 0.25   	0 Dummy )
                   	Notch ( 0.5   	0 Dummy )
                   	Notch ( 0.75   	0 Dummy )
                   	Notch ( 1   	0 Dummy )

			)
            )
            Injector2Water ( 0 1 0.1 0 
                NumNotches( 5 
				Notch ( 0     	0 Dummy )
                   	Notch ( 0.25   	0 Dummy )
                   	Notch ( 0.5   	0 Dummy )
                   	Notch ( 0.75   	0 Dummy )
                   	Notch ( 1   	0 Dummy )

			)
		)
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            Headlights( 0 1 0 )
        )

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( TornadoA2.cvf )
HeadOut (  -1.423 3.0 -5.25 )
Sound ("..\\..\\Common.Steam\\A1Sound\\A1cab.sms" )
Name ( "60503 A2/2 Thompson, LORD PRESIDENT, York Shed, TE 40.3Klbf - Coal 9t,\n"+ " Water 5000gal" )
Description (
"The P2 locomotives were built for the line between Edinburgh and Aberdeen, but the wheelbase was found to be too long for the continuous curves of this line. Also, the swing-link pony truck was causing damage by adding unnecessary stress to the frames. A similar pony truck arrangement on the V2's would eventually by fixed, but Thompson decided to approach the problem on the P2's with a complete rebuild. \n"+
"After rebuilding, the six A2/2 locomotives returned to Scotland to work the Edinburgh to Aberdeen line. At the end of 1949, they moved to England and were divided between the York and New England sheds. They kept their tablet exchange apparatus during the rebuilds, but this was removed after they were transferred to England. The A2-2 was consiered the least sucessful Thompson Pacific Locomotive design."
)
)
